#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```

grafana_folder.folder1: Refreshing state... [id=0:adc8sfaj7aozkf]
grafana_data_source.influxdb: Refreshing state... [id=1:edoulcuveakg0b]
grafana_dashboard.teltonika_lte: Refreshing state... [id=0:teltonika-lte]
grafana_dashboard.traffic_statistics: Refreshing state... [id=0:traffic-stats]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # grafana_dashboard.temperature will be created
  + resource "grafana_dashboard" "temperature" {
      + config_json  = jsonencode(
            {
              + annotations          = {
                  + list = [
                      + {
                          + builtIn    = 1
                          + datasource = {
                              + type = "datasource"
                              + uid  = "grafana"
                            }
                          + enable     = true
                          + hide       = true
                          + iconColor  = "rgba(0, 211, 255, 1)"
                          + name       = "Annotations & Alerts"
                          + target     = {
                              + limit    = 100
                              + matchAny = false
                              + tags     = []
                              + type     = "dashboard"
                            }
                          + type       = "dashboard"
                        },
                    ]
                }
              + editable             = true
              + fiscalYearStartMonth = 0
              + graphTooltip         = 0
              + links                = []
              + liveNow              = false
              + panels               = [
                  + {
                      + datasource  = {
                          + type = "influxdb"
                          + uid  = "11e7VrHnk"
                        }
                      + fieldConfig = {
                          + defaults  = {
                              + color      = {
                                  + mode = "palette-classic"
                                }
                              + custom     = {
                                  + axisBorderShow    = false
                                  + axisCenteredZero  = false
                                  + axisColorMode     = "text"
                                  + axisLabel         = ""
                                  + axisPlacement     = "auto"
                                  + barAlignment      = 0
                                  + barWidthFactor    = 0.6
                                  + drawStyle         = "line"
                                  + fillOpacity       = 0
                                  + gradientMode      = "none"
                                  + hideFrom          = {
                                      + legend  = false
                                      + tooltip = false
                                      + viz     = false
                                    }
                                  + insertNulls       = false
                                  + lineInterpolation = "linear"
                                  + lineWidth         = 1
                                  + pointSize         = 5
                                  + scaleDistribution = {
                                      + type = "linear"
                                    }
                                  + showPoints        = "auto"
                                  + spanNulls         = false
                                  + stacking          = {
                                      + group = "A"
                                      + mode  = "none"
                                    }
                                  + thresholdsStyle   = {
                                      + mode = "off"
                                    }
                                }
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "red"
                                          + value = 80
                                        },
                                    ]
                                }
                            }
                          + overrides = []
                        }
                      + gridPos     = {
                          + h = 14
                          + w = 24
                          + x = 0
                          + y = 0
                        }
                      + options     = {
                          + legend  = {
                              + calcs       = []
                              + displayMode = "list"
                              + placement   = "bottom"
                              + showLegend  = true
                            }
                          + tooltip = {
                              + mode = "single"
                              + sort = "none"
                            }
                        }
                      + targets     = [
                          + {
                              + datasource = {
                                  + type = "influxdb"
                                  + uid  = "11e7VrHnk"
                                }
                              + hide       = false
                              + query      = <<-EOT
                                    from(bucket: "Temperature")
                                      |> range(start: v.timeRangeStart, stop: v.timeRangeStop)
                                      |> filter(fn: (r) => r["_measurement"] == "tmp_in" or r["_measurement"] == "tmp_out")
                                      |> filter(fn: (r) => r["_field"] == "tmp_in")
                                      |> aggregateWindow(every: v.windowPeriod, fn: mean, createEmpty: false)
                                      |> yield(name: "mean")
                                EOT
                              + refId      = "A"
                            },
                          + {
                              + datasource = {
                                  + type = "influxdb"
                                  + uid  = "11e7VrHnk"
                                }
                              + hide       = false
                              + query      = <<-EOT
                                    from(bucket: "Temperature")
                                      |> range(start: v.timeRangeStart, stop: v.timeRangeStop)
                                      |> filter(fn: (r) => r["_measurement"] == "tmp_in" or r["_measurement"] == "tmp_out")
                                      |> filter(fn: (r) => r["_field"] == "tmp_out")
                                      |> aggregateWindow(every: v.windowPeriod, fn: mean, createEmpty: false)
                                      |> yield(name: "mean")
                                EOT
                              + refId      = "B"
                            },
                        ]
                      + title       = "Temperature"
                      + type        = "timeseries"
                    },
                ]
              + refresh              = ""
              + schemaVersion        = 39
              + tags                 = []
              + templating           = {
                  + list = []
                }
              + time                 = {
                  + from = "now-6h"
                  + to   = "now"
                }
              + timepicker           = {}
              + timezone             = ""
              + title                = "Temperature"
              + uid                  = "temperature"
              + weekStart            = ""
            }
        )
      + dashboard_id = (known after apply)
      + folder       = "adc8sfaj7aozkf"
      + id           = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: test-25.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "test-25.tfplan"
```

</details>

*Pusher: @germanium-git, Action: `pull_request`, Workflow: `Terraform: Test on PR open`*